STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/ucpd/usbpd_pwr_if.c
uint32_t _PWR_SRCVariablePDO(float _MAXV_, float _MINV_, float _C_);

uint32_t _PWR_SRCBatteryPDO(float _MAXV_,float _MINV_,float _PWR_);
/* Functions to initialize Sink PDOs */

uint32_t _PWR_SNKFixedPDO(float  _C_, float _V_,
                          USBPD_CORE_PDO_DRDataSupport_TypeDef DRDSupport,
                          USBPD_CORE_PDO_USBCommCapable_TypeDef UsbCommCapable,
                          USBPD_CORE_PDO_ExtPowered_TypeDef ExtPower,
                          USBPD_CORE_PDO_HigherCapability_TypeDef HigherCapab,
                          USBPD_CORE_PDO_DRPowerSupport_TypeDef DRPSupport);

uint32_t _PWR_SNKVariablePDO(float  _MAXV_,float _MINV_,float _C_);

uint32_t _PWR_SNKBatteryPDO(float _MAXV_,float _MINV_,float _PWR_);
#if _PPS
uint32_t _PWR_ProgrammablePowerSupplyAPDO(float _MAXC_,float _MINV_,float _MAXV_);
#endif

void     _PWR_CheckPDOContent(uint8_t PortNum);

/**
  * @}
  */
/* USER CODE END USBPD_USER_PRIVATE_FUNCTIONS_Prototypes */

/* Private functions ---------------------------------------------------------*/
/** @addtogroup STM32_USBPD_APPLICATION_POWER_IF_Exported_Functions
  * @{
  */

/**
  * @brief  Initialize structures and variables related to power board profiles
  *         used by Sink and Source, for all available ports.
  * @retval USBPD status
*/
USBPD_StatusTypeDef USBPD_PWR_IF_Init(void)
{
/* USER CODE BEGIN USBPD_PWR_IF_Init */
  USBPD_StatusTypeDef _status = USBPD_OK;
#if defined(_GUI_INTERFACE)
  uint32_t index;
#endif /* _GUI_INTERFACE */

  /* Set links to PDO values and number for Port 0 (defined in PDO arrays in H file).
   */
#if defined(_SRC)||defined(_DRP)
#if defined(_GUI_INTERFACE)
  for (index = 0; index < USBPD_MAX_NB_PDO; index++)
  {
    /* SRC PDO for Port 0 */
    PWR_Port_PDO_Storage[USBPD_PORT_0].SourcePDO.ListOfPDO[index] = PORT0_PDO_ListSRC[index];
  }
#else
  PWR_Port_PDO_Storage[USBPD_PORT_0].SourcePDO.ListOfPDO = (uint32_t *) PORT0_PDO_ListSRC;
#endif /* _GUI_INTERFACE */
  PWR_Port_PDO_Storage[USBPD_PORT_0].SourcePDO.NumberOfPDO = USBPD_NbPDO[1];
#endif /* _SRC || _DRP */

#if defined(_SNK)||defined(_DRP)
#if defined(_GUI_INTERFACE)
  for (index = 0; index < USBPD_MAX_NB_PDO; index++)
  {
    /* SNK PDO for Port 0 */
    PWR_Port_PDO_Storage[USBPD_PORT_0].SinkPDO.ListOfPDO[index] = PORT0_PDO_ListSNK[index];
  }
#else
  PWR_Port_PDO_Storage[USBPD_PORT_0].SinkPDO.ListOfPDO = (uint32_t *)PORT0_PDO_ListSNK;
#endif /* _GUI_INTERFACE */
  PWR_Port_PDO_Storage[USBPD_PORT_0].SinkPDO.NumberOfPDO = USBPD_NbPDO[0];
  _status |= USBPD_PWR_IF_CheckUpdateSNKPower(USBPD_PORT_0);
#endif

  /* Add consistency check on PDO definition 
     Could help to detect unexpected flash settings content */
  _PWR_CheckPDOContent(USBPD_PORT_0);

  return _status;
/* USER CODE END USBPD_PWR_IF_Init */
}

#if defined(_SRC) || defined(_DRP)
/**
  * @brief  Sets the required power profile, now it works only with Fixed ones
  * @param  PortNum               Port number
  * @retval USBPD status
*/
USBPD_StatusTypeDef USBPD_PWR_IF_SetProfile(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_PWR_IF_SetProfile */
  USBPD_StatusTypeDef      _ret = USBPD_ERROR;
  USBPD_PDO_TypeDef        _pdo;
  USBPD_SNKRDO_TypeDef     _rdo;
#if _PPS
  static USBPD_SNKRDO_TypeDef _rdo_previous = {
                                                .d32 = 0
                                              };
#endif /* _PPS */

  uint32_t _vbusTargetInmv = 0;
  uint32_t _PowerProfileSelected =  DPM_Ports[PortNum].DPM_RDOPosition - 1;
  uint8_t counter = 0;

  /* Check if valid port */
  /* Check if profile nb is valid for this port */
  if(( !USBPD_PORT_IsValid(PortNum) ) || (_PowerProfileSelected >= PWR_Port_PDO_Storage[PortNum].SourcePDO.NumberOfPDO)
     || (0 == PWR_Port_PDO_Storage[PortNum].SourcePDO.NumberOfPDO))
  {
    return _ret;
  }

  _pdo.d32 = PWR_Port_PDO_Storage[PortNum].SourcePDO.ListOfPDO[_PowerProfileSelected];
  _rdo.d32 = DPM_Ports[PortNum].DPM_RcvRequestDOMsg;

  switch(_pdo.GenericPDO.PowerObject)
  {
  case USBPD_CORE_PDO_TYPE_FIXED :
    {
      _vbusTargetInmv               = _pdo.SRCFixedPDO.VoltageIn50mVunits * 50;
      uint32_t _OperatingCurrent    = _rdo.FixedVariableRDO.OperatingCurrentIn10mAunits * 10;
      uint32_t _MaxOperatingCurrent = _rdo.FixedVariableRDO.MaxOperatingCurrent10mAunits * 10;

      _ret = BSP_USBPD_PWR_VBUSSetVoltage_Fixed(PortNum, _vbusTargetInmv, _OperatingCurrent, _MaxOperatingCurrent) == BSP_ERROR_NONE ? USBPD_OK: USBPD_ERROR;
      break;
    }
  case USBPD_CORE_PDO_TYPE_VARIABLE :
    {
      _vbusTargetInmv               = _pdo.SRCVariablePDO.MinVoltageIn50mVunits * 50;
      uint32_t _vbusTargetMaxInmv   = _pdo.SRCVariablePDO.MaxVoltageIn50mVunits * 50;
      uint32_t _OperatingCurrent    = _rdo.FixedVariableRDO.OperatingCurrentIn10mAunits * 10;
      uint32_t _MaxOperatingCurrent = _rdo.FixedVariableRDO.MaxOperatingCurrent10mAunits * 10;

      _ret = BSP_USBPD_PWR_VBUSSetVoltage_Variable(PortNum, _vbusTargetInmv, _vbusTargetMaxInmv, _OperatingCurrent, _MaxOperatingCurrent) == BSP_ERROR_NONE ? USBPD_OK: USBPD_ERROR;
      break;
    }
#if _PPS
  case USBPD_CORE_PDO_TYPE_APDO :
    {
      _vbusTargetInmv      = _rdo.ProgRDO.OutputVoltageIn20mV * 20;
      uint32_t _OperatingCurrent    = _rdo.ProgRDO.OperatingCurrentIn50mAunits * 50;
      int32_t _delta = 0;
      if(_rdo.ProgRDO.ObjectPosition == _rdo_previous.ProgRDO.ObjectPosition)
      {
        _delta = (_rdo_previous.ProgRDO.OutputVoltageIn20mV - _rdo.ProgRDO.OutputVoltageIn20mV) * 20;
      }
      _ret = BSP_USBPD_PWR_VBUSSetVoltage_APDO(PortNum, _vbusTargetInmv, _OperatingCurrent, _delta) == BSP_ERROR_NONE ? USBPD_OK: USBPD_ERROR;
      break;
    }
#endif /* _PPS */
  case USBPD_CORE_PDO_TYPE_BATTERY :
  default :
    {
      /* not yet implemented */
      return _ret;
    }
  }

#if _PPS
  /* save the previous rd, mainly for APDO management */
  _rdo_previous.d32 = _rdo.d32;

  if (_ret != USBPD_OK)
  {
    _rdo_previous.d32 = 0;
    return _ret;
  }
  else
#endif /* _PPS */
  {
    /* before sending PS_READY if the power is at the expected level */
    int32_t _delta;
    uint32_t _vbusOriginInmv;
    uint8_t _exit = 0;

    /* Set the power, the precision must be at 5% for a fixed PDO */
    uint32_t _precision = (_vbusTargetInmv * 5) / 100;
    do {
      counter++;
      USBPD_DPM_WaitForTime(5);
      BSP_USBPD_PWR_VBUSGetVoltage(PortNum, &_vbusOriginInmv);
#ifdef _TRACE
      char str[10];
      sprintf(str, "V:%5d", _vbusOriginInmv);
      POWER_IF_TRACE(PortNum, (uint8_t*)str, strlen(str));
#endif /* _TRACE */
      _delta = _vbusOriginInmv - _vbusTargetInmv;
      if((ABS(_delta)) < _precision)
      {
        _exit = 1;
      }
    }while((_exit == 0) && (counter < 25));
  }

  if (25 == counter)
    return USBPD_FAIL;
  else
    return USBPD_OK;
/* USER CODE END USBPD_PWR_IF_SetProfile */
}
#endif /* _SRC|| _DRP */

/**
  * @brief  Checks if the power on a specified port is ready
  * @param  PortNum Port number
  * @param  Vsafe   Vsafe status based on @ref USBPD_VSAFE_StatusTypeDef
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_PWR_IF_SupplyReady(uint8_t PortNum, USBPD_VSAFE_StatusTypeDef Vsafe)
{
/* USER CODE BEGIN USBPD_PWR_IF_SupplyReady */
  USBPD_StatusTypeDef status = USBPD_ERROR;
  uint32_t _voltage;

  /* check for valid port */
  if (!USBPD_PORT_IsValid(PortNum))
  {
    return USBPD_ERROR;
  }

  BSP_USBPD_PWR_VBUSGetVoltage(PortNum, &_voltage);
  if (USBPD_VSAFE_0V == Vsafe)
  {
    /* Vsafe0V */
    status = ((_voltage < USBPD_PWR_LOW_VBUS_THRESHOLD)? USBPD_OK: USBPD_ERROR);
  }
  else
  {
    /* Vsafe5V */
    status = ((_voltage > USBPD_PWR_HIGH_VBUS_THRESHOLD)? USBPD_OK: USBPD_ERROR);
  }

